<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="sk" xml:lang="sk">
  
<!-- Mirrored from www.drupal.sk/book/export/html/580 by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 05 Jan 2017 18:44:52 GMT -->
<!-- Added by HTTrack --><meta http-equiv="content-type" content="text/html;charset=utf-8" /><!-- /Added by HTTrack -->
<head>
<meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <meta http-equiv="Content-Type" content="text/html; charset=utf-8" />
    <title>Budujeme web</title>
    <base  />
    <link type="text/css" rel="stylesheet" href="http://drupal.sk/misc/print.css" />
      </head>
  <body>
              <div class="section-1">
          
    <div id="node-580" class="section-2">
  <h1 class="book-heading">Budujeme web</h1>
    <div id="node-385" class="section-3">
  <h1 class="book-heading">Hlavné moduly</h1>
  
<p>Drupal v súčasnosti (december 2009) ponúka viac ako 5000 modulov, ktoré
rozširujú možnosti základného systému prakticky donekonečna :)</p>

<p>v skutočnosti však na realizáciu vášho webu pravdepodobne budete
potrebovať len niekoľko z nich.</p>

<p>Bez niektorých modulov, ktoré nie sú súčasťou jadra Drupalu, sa
jednoducho nezaobídete. Táto stránka slúži ako predstavenie najčastejšie
používaných modulov a ich stručné charakteristiky, prípadne odkaz na
alternatívy.</p>

<p>Odorúčame vám prezrieť si zoznam aktuálne najpoužívanejších modulov,
ktorý nájdete na <a
href="http://drupal.org/project/usage/">http://drupal.org/project/usage/</a></p>

<h1>Views</h1>

<p>Generuje zoznamy objektov – uzly, užívatelia, termíny taxonómie podľa
vami zadaných kritérií a parametrov. Ideálne na vytváranie blokov,
stránok, súhrnov, tabuliek.</p>

<h1>Token</h1>

<p>Umožňuje vkladať do textu na predznačené miesta údaje z databázy.
<em>(Od verzie 7 súčasť jadra)</em></p>

<h1>Content Construction Kit (CCK)</h1>

<p>Postavte si vlastný obsahový typ s vlastnou zostavou editovateľných
polí. Obsahové typy môžu byť medzi sebou prepojené a vytvárať sieť
vzťahov. Pre pole určíte spôsob zadávania(widget), spôsob prezentácie
(formatter). <em>(Od verzie 7 súčasť jadra)</em></p>

<h1>Pathauto</h1>

<p>Vysoko konfigurovateľné vytváranie ľahko zapamätateľných ciest
k obsahu. Namiesto <a
href="../../../../node/385/index.html">http://drupal.sk/node/385</a> tak uvidíte
napr. <a
href="http://drupal.sk/drupal-hlavne-moduly.html">http://drupal.sk/…-moduly.html</a></p>

<h1>FileField</h1>

<p>Náhrada za štandardne dodávaný modul Upload. Je to CCK pole umožňujúce
pripájať súbory k uzlom.</p>

<h1>ImageField</h1>

<p>Rozšírenie pre FileField, umožnujúce pripájať k uzlom obrázky.</p>

<h1>ImageCache</h1>

<p>Nastavte si profily pre spracovanie nahratých obázkov. Umožňuje
generovať a zobrazovať jeden obrázok do viacerých veľkostí, tvarov,
prípadne aj zložitejšie efekty. Dôležitá prerekvizita je modul
ImageAPI.</p>

<h1>Date a Calendar</h1>

<p>Kompletná sada na vkladanie a zobrazovanie dátumov, časových zón,
vlastných formátov, udalostí.</p>

<h1>Google Analytics</h1>

<p>Integrácia analytických nástrojov o návštevnosti stránok.</p>

<h1>Poormanscron</h1>

<p>V prípade že nemáte možnosť využívať cron na vašom webhostingu,
tento modul vám poskytne dobré služby namiesto neho. <em>(Od verzie
7 súčasť jadra)</em></p>

<h1>Webform</h1>

<p>Vytváranie, správa, štatistiky webových formulárov na vypĺňanie
návštevníkmi vašich stránok.</p>

<h1>CAPTCHA a ReCAPTCHA</h1>

<p>Ochráňte svoje formuláre pred nežiadúcimi príspevkami zo spambotov.</p>

<h1>Wysiwyg</h1>

<p>API pre používanie wysiwyg editorov na vašich stránkach. Obsahuje podporu
pre veľké množstvo editorov – (F)CKEditor, TinyMCE, BUEditor a
ďalšie.</p>

<h1>CKEditor</h1>

<p>Jeden z najpopulárnejšich wysiwyg editorčekov.</p>

<h1>IMCE</h1>

<p>Manažér obrízkov a súborov pre redaktorov obsahu. Umožňuje vkladanie
obrázkov do textu atď.</p>

<h1>Lightbox2</h1>

<p>Obľúbené js riešenie na prezentáciu obrázkov.</p>

<h1>Nodewords</h1>

<p>Definovanie kľúčových slov pre každú stránku zvlášť.</p>

<h1>XML Sitemap</h1>

<p>Generovanie mapy stránok pre zlepšenie indexovania vo vyhľadávačoch.</p>

<h1>Backup And Migrate</h1>

<p>Ručné, prípadne automatické vytváranie záloh databázy do priečinka na
serveri.</p>
  </div>
<div id="node-516" class="section-3">
  <h1 class="book-heading">Moduly pre vývojárov a správcov</h1>
  
<p>Okrem modulov na budovanie stránky sú tu aj moduly, ktoré uľahčujú
prácu vývojárom a správcom stránky.</p>

<h1>Administration Menu</h1>

<p>Pohodlné roletkové menu, používané administrátorom namiesto klasického
bloku Navigácia. Šetrí mnoho času, pretože obsahuje mnoho vychytávok
spríjemňujúcich prá­cu.</p>

<h1>Devel</h1>

<p>Sada vývojárskych modulov. Testovanie výkonu, štatistiky, generovanie
obsahu, pomôcky pri témovaní, výpise premenných a mnoho ďalšieho.</p>

<h1>drush</h1>

<p>nie tak celkom modul, skôr sada shell skriptov pre prácu s drupal
z príkazového riadku. Ohromne uľahčuje najmä inštaláciu, aktiváciu a
deaktiváciu modulov. Na úspešné použitie však potrebujete shell prístup
na server.</p>

<h1>Drupal for Firebug</h1>

<p>Skladá sa z modulu pre drupal a Firefox pluginu. Zobrazuje premenné
drupalu v konzole rozšírenia Firebug.</p>

<h1>SimpleTest</h1>

<p>Balík pre automatizované testovanie</p>
  </div>
<div id="node-587" class="section-3">
  <h1 class="book-heading">Návody</h1>
  <p>Na tomto mieste budeme zhromažďovať návody na realizáciu rôznej funkcionality, ktorú zvládnete bez programovania.</p>
  <div id="node-546" class="section-4">
  <h1 class="book-heading">Ako vytvoriť abecedný index pre view v Drupale?</h1>
  <p>Predvčerom mi z&aacute;kazn&iacute;k poslal e-mailom požiadavku, že chce ist&yacute; zoznam na jeho webe zoradiť podľa abecedy a pridať k nemu aj abecedn&yacute; index. Tak&yacute;, kde je každ&eacute; p&iacute;smeno abecedy odkazom za str&aacute;nku, na ktorej bud&uacute; zobrazen&eacute; len tie položky zoznamu, ktor&eacute; zač&iacute;naj&uacute; na konkr&eacute;tne p&iacute;smeno. Vďaka tomu, že jeho web je postaven&yacute; na Drupale som to mal hotov&eacute; veľmi r&yacute;chlo a odozva to potvrdila. <em>&quot;Nuž, niet nad spokojn&eacute;ho z&aacute;kazn&iacute;ka&quot;</em>, vrav&iacute;m si v tak&yacute;ch chv&iacute;ľach. St&aacute;le mi v&scaron;ak vŕtalo hlavou, či na to rie&scaron;enie, ktor&eacute; som spravil bez použitia na to určen&eacute;ho modulu, predsalen nejak&yacute; neexistuje. Existuje. Vol&aacute; sa <a href="http://drupal.org/project/views_alpha_pager">Views Alpha Pager</a> a jeho jedinou chybou je, že pre Drupal 6, resp. pre Views 2 neexistuje vydanie. A tak bolo pravdepodobne moje rie&scaron;enie asi jedin&yacute;m možn&yacute;m (i keď vari&aacute;ci&iacute; naň m&ocirc;že byť viacero). Tak sa na to poďme pozrieť:Cel&yacute; trik je v tom, že p&iacute;smeno abecedy budeme Drupalu pods&uacute;vať v URI, teda v odkaze. Takže v&scaron;etky čl&aacute;nky zač&iacute;naj&uacute;ce na A bud&uacute; mať adresu <code>www.nasweb.sk/clanky/a</code>. Tak&yacute;to parameter pred&aacute;van&yacute; v URI sa vo Views terminol&oacute;gii vol&aacute; argument. Jeden si teda v na&scaron;om view aj hneď prid&aacute;me a nastav&iacute;me ho zhruba podľa priložen&eacute;ho obr&aacute;zku. <img src="http://drupal.sk/files/screen.png" /> Kľ&uacute;čov&yacute;m nastaven&iacute;m je v ňom tzv. <strong>Glossary mode</strong>, ktor&yacute; zaruč&iacute; pr&aacute;ve to, že si budeme m&ocirc;cť nastaviť limit pre počet p&iacute;smen v argumente. My kontrolujeme len prv&eacute;, takže limit bude celkom logicky 1. Toto je t&aacute; jednoduch&scaron;ia, klikacia časť. Ak chceme pridať nad view aj abecedn&yacute; index tak n&aacute;s čak&aacute; aj tro&scaron;ku p&iacute;sania k&oacute;du, i keď je to k&oacute;d veľmi primit&iacute;vny a v&auml;č&scaron;inu čas budeme aj tak použ&iacute;vať len CTRL+C a CTRL+V. Tento k&oacute;d bude vyzerať nejako takto: <code> &lt;div class=&quot;abeceda&quot;&gt; &lt;a href=&quot;http://www.nasweb.sk/clanky/a&quot;&gt;a&lt;/a&gt; &lt;a href=&quot;http://www.nasweb.sk/clanky/b&quot;&gt;b&lt;/a&gt; &lt;a href=&quot;http://www.nasweb.sk/clanky/c&quot;&gt;c&lt;/a&gt; </code> a tak ďalej až po Z. A nap&iacute;&scaron;eme ho, samozrejme, do hlavičky view. Nezabudnite zvoliť pr&iacute;slu&scaron;n&yacute; vstupn&yacute; form&aacute;t tak, aby akceptoval v&scaron;etky HTML tagy, ktor&eacute; ste použili, pretože ako som už naznačil, vari&aacute;ci&iacute; na tento n&aacute;pad m&ocirc;že byť viac a možno pr&iacute;dete na niečo in&eacute;, čo by sa v&aacute;m e&scaron;te zi&scaron;lo. Ja v&aacute;m pre tentokr&aacute;t m&ocirc;žem sľ&uacute;biť len to že ak sa mi podar&iacute; zistiť ako nastaviť variabiln&uacute; dĺžku argumentu, nap&iacute;&scaron;em e&scaron;te lep&scaron;&iacute; n&aacute;vod. Totižto, jedin&yacute;m probl&eacute;mom s ktor&yacute;m si zatiaľ neviem rady je nastavenie view tak aby bral do &uacute;vahy argumenty o r&ocirc;znej dĺžke. To znamen&aacute;, že čl&aacute;nok zač&iacute;naj&uacute;ci napr&iacute;klad slovom Drupal sa objav&iacute; na str&aacute;nke <code>www.nasweb.sk/clanok/d</code> ale aj <code>www.nasweb.sk/clanok/dru</code>. Zatiaľ som sa dozvedel len toľko, že si na to budem musieť nap&iacute;sať vlastn&yacute; argument handler. Ak sa mi to podar&iacute;, r&aacute;d sa oň s vami podel&iacute;m.</p>
  </div>
</div>
<div id="node-588" class="section-3">
  <h1 class="book-heading">Zdroje tretích strán</h1>
  
<p>Návody na drupal zo serverov tretích strán.</p>

<ul>
	<li><a
	href="http://video.sospreskoly.org/video/Drupal/">http://video.sospreskoly.org/video/Drupal/</a> –
	niekoľko zaujímavych videonávodov pre začiatočníkov.</li>
</ul>

<!-- by Texy2! -->  </div>
</div>
    </div>
  </body>

<!-- Mirrored from www.drupal.sk/book/export/html/580 by HTTrack Website Copier/3.x [XR&CO'2014], Thu, 05 Jan 2017 18:44:52 GMT -->
</html>
